Охотники_и_рыболовы/src/InformationRegisters/УстановленныеДатыСезонаОхоты/УстановленныеДатыСезонаОхоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановленныеДатыСезонаОхоты</name>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СезонЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ЦеныПоВидамДичи/ЦеныПоВидамДичи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоВидамДичи</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаСвоимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСвоимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаШтатнымСотрудникам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаВетеранамВойны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаИнвалидамПервойГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаПослеВозрастногоПорога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоСезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеОсобыхЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ДанныеПроизводственногоКалендаря/ДанныеПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПроизводственногоКалендаря</name>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыДнейПроизводственногоКалендаря/ВидыДнейПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Documents/ПутевкаДоговор/ПутевкаДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПутевкаДоговор</name>
  <basedOn>Document.РазрешениеНаОхоту</basedOn>
  <registerRecords>AccumulationRegister.ПродажаПутевок</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РазрешениеНаОхоту</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Охотники_и_рыболовы/src/Documents/Заявление/Заявление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявление</name>
  <basedOn>Document.РазрешениеНаОхоту</basedOn>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РазрешениеНаОхоту</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Охотники_и_рыболовы/src/Catalogs/СезоныОхоты/СезоныОхоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СезоныОхоты</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СезонЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/Catalogs/Дичь/Дичь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Дичь</name>
  <tabularSections>
    <name>ВидыДичи</name>
    <attributes>
      <name>ВидДичи</name>
      <type>
        <types>CatalogRef.ВидыДичи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Охотники_и_рыболовы/src/CommonModules/ОхотаСервер/Module.bsl
Процедура ПоказатьСообщение(Текст,Поле = Неопределено) Экспорт
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Если НЕ Поле = Неопределено Тогда
		Сообщение.Поле = Поле;
	КонецЕсли;
	
	Сообщение.Сообщить();	
КонецПроцедуры

Функция УстановитьТекущийСезон(ОбъектЗначение) Экспорт
	Установили = Новый Структура("КодВозврата,ОписаниеОшибки");
	Менеджер = Константы.ТекущийСезон.СоздатьМенеджерЗначения(); 
	Установлено = Константы.ТекущийСезон.Получить();
		Менеджер.Значение = ?(ОбъектЗначение.СезонЗакрыт,Справочники.СезоныОхоты.ПустаяСсылка(),ОбъектЗначение.Ссылка);
		Попытка
			Менеджер.Записать();
		Исключение
			Установили.Вставить("КодВозврата",Ложь);	
		    Установили.Вставить("ОписаниеОшибки",ОписаниеОшибки());
			Возврат Установили;	
		КонецПопытки;
	Установили.Вставить("КодВозврата",Истина);
	ОбновитьПовторноИспользуемыеЗначения();
	ЗаписьЖурналаРегистрации("Установка текущего сезона",УровеньЖурналаРегистрации.Информация,,,"Выполнена установка");
	
	Возврат Установили;	
КонецФункции

Процедура ОчиститьСезоны() Экспорт
	Выборка = Справочники.ВидыДичи.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект =Выборка.Ссылка.ПолучитьОбъект();	
		Объект.Удалить();
	КонецЦикла;	

	Выборка = Справочники.Пользователи.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект =Выборка.Ссылка.ПолучитьОбъект();	
		Объект.Удалить();
	КонецЦикла;	

	
	Выборка = Справочники.Дичь.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект =Выборка.Ссылка.ПолучитьОбъект();	
		Объект.Удалить();
	КонецЦикла;
	
	Выборка = Справочники.СезоныОхоты.Выбрать();
	Массив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Массив.Очистить();
		Массив.Добавить(Выборка.Ссылка);
		УдалитьОбъекты( Массив,Ложь);
	КонецЦикла;
	
	Мен = Константы.ТекущийСезон.СоздатьМенеджерЗначения();
	Мен.Записать();
	
	
КонецПроцедуры

Функция ИзменитьСезон(ОбъектЗначение,Действие = Неопределено) Экспорт
	НачатьТранзакцию();
	
		Если ОбъектЗначение.Ссылка.Пустая()	Тогда
			элемент = Справочники.СезоныОхоты.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(элемент,ОбъектЗначение,,"Родитель,Владелец");	
		Иначе			
			элемент = ОбъектЗначение;
		КонецЕсли;
		
		элемент.Наименование = "Сезон охоты " + Строка(Год(ОбъектЗначение.ДатаНачала)) + " - " + Строка(Год(ОбъектЗначение.ДатаОкончания)) + " года.";
		элемент.Наименование = СтрЗаменить(элемент.Наименование,Символы.НПП,"");
		
		Если Действие = "Открыть" Тогда
			элемент.СезонЗакрыт = Ложь
		ИначеЕсли Действие = "Закрыть" Тогда
			элемент.СезонЗакрыт = Истина
		КонецЕсли;	
		
	
	Попытка
		элемент.Записать();	
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	//////////////////
	///Установка текущего сезона в константу
	ЕстьОшибки = УстановитьТекущийСезон(элемент);
	
	Если НЕ ЕстьОшибки.КодВозврата Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ЕстьОшибки.ОписаниеОшибки);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;	

	////////////////////////////
	///// запись в регистр сведений
	
	Набор = РегистрыСведений.УстановленныеДатыСезонаОхоты.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(Набор,элемент);
	Набор.СезонОхоты = элемент.Ссылка;
	
	Попытка
		Набор.Записать();	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	ОбъектЗначение = элемент;
	
	Возврат Истина;
КонецФункции

Функция ПолучитьПериодыОхоты(Объект) Экспорт
	
	Если Объект.Дата = '00010101' Тогда
		Дата = ТекущаяДата();
	Иначе
		Дата = Объект.Дата;
	КонецЕсли;

	Запрос = Новый Запрос;
				   
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦеныПоВидамДичи.ВидДичи,
			|	ЦеныПоВидамДичи.ДатаНачала,
			|	ЦеныПоВидамДичи.ДатаОкончания,
			|	ЦеныПоВидамДичи.ТолькоСезонная,
			|	ДанныеПроизводственногоКалендаря.Дата КАК РазоваяДатаНачала,
			|	ДОБАВИТЬКДАТЕ(ДанныеПроизводственногоКалендаря.Дата, ДЕНЬ, 2) КАК РазоваяДатаОкончания
			|ИЗ
			|	РегистрСведений.ЦеныПоВидамДичи.СрезПоследних(
			|			&Дата,
			|			СезонОхоты = &СезонОхоты
			|				И ВидДичи = &ВидДичи) КАК ЦеныПоВидамДичи
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
			|		ПО (ДанныеПроизводственногоКалендаря.Дата МЕЖДУ ЦеныПоВидамДичи.ДатаНачала И ЦеныПоВидамДичи.ДатаОкончания)
			|			И (ВЫБОР
			|				КОГДА НЕ ЦеныПоВидамДичи.ТолькоСезонная
			|					ТОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
			|				ИНАЧЕ ЛОЖЬ
			|			КОНЕЦ)";
				
	
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("СезонОхоты",Объект.СезонОхоты);
	Запрос.УстановитьПараметр("ВидДичи",Объект.ВидДичи);
	Возврат Запрос.Выполнить();
		
КонецФункции

Функция ПолучитьПринтеры() Экспорт 
	
    scrptCtrl=Новый COMОбъект("MSScriptControl.ScriptControl"); 
    scrptCtrl.language="vbscript"; 
    scrptCtrl.addcode(" 
    |Function GetDefaultPrinter() 
    |GetDefaultPrinter=vbNullString              
	|Set objWMIService=GetObject(""winmgmts:"" _ 
    |& ""{impersonationLevel=impersonate}!\\" + ИмяКомпьютера() + "\root\cimv2"") 
    |Set colInstalledPrinters=objWMIService.ExecQuery _ 
    |(""Select * from Win32_Printer"") 
	|For Each objPrinter in colInstalledPrinters        
	|If objPrinter.Attributes and 4 Then 
	|GetDefaultPrinter=objPrinter.Name 
	|Exit For 
	|End If 
	|Next 
	|End Function"); 
	
	попытка
		ПринтерПоУмолчанию = scrptCtrl.run("GetDefaultPrinter");
	Исключение
		Текст = ОписаниеОшибки();
		Возврат Новый ТаблицаЗначений;
	Конецпопытки;
	
	КомОбъектНетВорк  = Новый COMОбъект("WScript.Network");
	КолПринтеры = КомОбъектНетВорк.EnumPrinterConnections();
	
	мПринтеры = Новый ТаблицаЗначений;
	мПринтеры.Колонки.Добавить("Имя");
	мПринтеры.Колонки.Добавить("ПоУмолчанию");
	мПринтеры.Колонки.Добавить("ИмяПорта");

	Количество = КолПринтеры.length - 1;
	
	
	а=0;
	Пока Количество > а Цикл
		стр =  мПринтеры.Добавить();
		стр.Имя = КолПринтеры.Item(а+1);
		стр.ИмяПорта = КолПринтеры.Item(а);
		стр.ПоУмолчанию = ?(стр.Имя = ПринтерПоУмолчанию,Истина,Ложь);
			
		а = а+2;
	КонецЦикла;
	мПринтеры.Сортировать("ПоУмолчанию Убыв");
	
	
	Возврат мПринтеры;
КонецФункции  

Функция НайтиПодчиненнуюПутевку(ДокументСсылка)Экспорт
	ПустойДокумент = Документы.ПутевкаДоговор.ПустаяСсылка();
	
	Если не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат ПустойДокумент;
	КонецЕсли;
	
	НайденныйДокумент = ПустойДокумент;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Путевка.Ссылка
	               |ИЗ
	               |	Документ.ПутевкаДоговор КАК Путевка
	               |ГДЕ
	               |	Путевка.ДокументОснование = &ДокументСсылка";
										
	
	ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();

	Если ВыборкаИзЗапроса.Следующий() Тогда
		НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
	КонецЕсли;

	Возврат НайденныйДокумент;
	
КонецФункции

Функция НайтиПодчиненноеЗаявление(ДокументСсылка)Экспорт
	ПустойДокумент = Документы.Заявление.ПустаяСсылка();
	
	Если не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат ПустойДокумент;
	КонецЕсли;
	
	НайденныйДокумент = ПустойДокумент;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Заявление.Ссылка
	               |ИЗ
	               |	Документ.Заявление КАК Заявление
	               |ГДЕ
	               |	Заявление.ДокументОснование = &ДокументСсылка";
										
	
	ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();

	Если ВыборкаИзЗапроса.Следующий() Тогда
		НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
	КонецЕсли;

	Возврат НайденныйДокумент;
	
КонецФункции

Функция ПолучитьТекстПутевки(Путевка) Экспорт

	Если Не ЗначениеЗаполнено(Путевка) Тогда
		Возврат "Ввести путевку";
	Иначе
		Возврат Строка(Путевка) + ?(Путевка.ПометкаУдаления, " (помечен на удаление)", "");
	КонецЕсли;

КонецФункции 

Функция НайтиПоИмени(Знач ИмяДляВхода) Экспорт
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяДляВхода);
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		ОхотаСлужебный.НайтиНеоднозначныхПользователейИБ(, ПользовательИБ.УникальныйИдентификатор);
		
		Возврат Справочники.Пользователи.НайтиПоРеквизиту(
			"ИдентификаторПользователяИБ",
			ПользовательИБ.УникальныйИдентификатор);
	КонецЕсли;
	
КонецФункции

Функция ПользовательАктуален() Экспорт
	Возврат НЕ ПараметрыСеанса.АвторизованныйПользователь.Пустая();	
КонецФункции

Процедура УстановитьОтборДинамическогоСписка(Список) Экспорт
	
	Для каждого Роль из ОхотаСерверПовтИсп.ОсновныеРоли() Цикл
		Если РольДоступна(Роль) Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ОснОрганизация = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация");
	
	Охотхозяйство = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОрганизация);
	
	Список.Параметры.УстановитьЗначениеПараметра("Охотхозяйство",Охотхозяйство);

	
КонецПроцедуры

Функция ПрочитатьПользователяИБ(Знач Идентификатор,
                                Свойства = Неопределено,
                                ОписаниеОшибки = "",
                                ПользовательИБ = Неопределено) Экспорт
	
	Свойства = НовоеОписаниеПользователяИБ();
	
	Свойства.Роли = Новый Массив;
	
	Если ТипЗнч(Идентификатор) = Тип("УникальныйИдентификатор") Тогда
		
		Если Идентификатор = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор Тогда
			
			ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		Иначе
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Идентификатор);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Идентификатор);
	Иначе
		ПользовательИБ = Неопределено;
	КонецЕсли;
	
	Если ПользовательИБ = Неопределено Тогда
		ОписаниеОшибки = ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Пользователь информационной базы ""%1"" не найден.'"), Идентификатор);
		Возврат Ложь;
	КонецЕсли;
	
	СкопироватьСвойстваПользователяИБ(Свойства, ПользовательИБ);
	
	Возврат Истина;
	
КонецФункции

Функция НовоеОписаниеПользователяИБ() Экспорт
	
	// Подготовка структур возвращаемых данных.
	Свойства = Новый Структура;
	
	Свойства.Вставить("УникальныйИдентификатор",
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Свойства.Вставить("Имя",                       "");
	Свойства.Вставить("ПолноеИмя",                 "");
	Свойства.Вставить("АутентификацияOpenID",      Ложь);
	Свойства.Вставить("АутентификацияСтандартная", Ложь);
	Свойства.Вставить("ПоказыватьВСпискеВыбора",   Ложь);
	Свойства.Вставить("СтарыйПароль",              Неопределено);
	Свойства.Вставить("Пароль",                    Неопределено);
	Свойства.Вставить("СохраняемоеЗначениеПароля", Неопределено);
	Свойства.Вставить("ПарольУстановлен",          Ложь);
	Свойства.Вставить("ЗапрещеноИзменятьПароль",   Ложь);
	Свойства.Вставить("АутентификацияОС",          Ложь);
	Свойства.Вставить("ПользовательОС",            "");
	
	Свойства.Вставить("ОсновнойИнтерфейс",
		?(Метаданные.ОсновнойИнтерфейс = Неопределено, "", Метаданные.ОсновнойИнтерфейс.Имя));
	
	Свойства.Вставить("РежимЗапуска",              "Авто");
	
	Свойства.Вставить("Язык",
		?(Метаданные.ОсновнойЯзык = Неопределено, "", Метаданные.ОсновнойЯзык.Имя));
	
	Свойства.Вставить("Роли", Неопределено);
	
	Возврат Свойства;
	
КонецФункции

Процедура СкопироватьСвойстваПользователяИБ(Приемник,
                                            Источник,
                                            КопируемыеСвойства = "",
                                            ИсключаемыеСвойства = "",
                                            ПрефиксСвойств = "") Экспорт
	
	ВсеСвойства = НовоеОписаниеПользователяИБ();
	
	Если ЗначениеЗаполнено(КопируемыеСвойства) Тогда
		СтруктураКопируемыхСвойств = Новый Структура(КопируемыеСвойства);
	Иначе
		СтруктураКопируемыхСвойств = ВсеСвойства;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИсключаемыеСвойства) Тогда
		СтруктураИсключаемыхСвойств = Новый Структура(ИсключаемыеСвойства);
	Иначе
		СтруктураИсключаемыхСвойств = Новый Структура;
	КонецЕсли;
	
	ПарольУстановлен = Ложь;
	
	Для каждого КлючИЗначение Из ВсеСвойства Цикл
		Свойство = КлючИЗначение.Ключ;
		
		Если НЕ СтруктураКопируемыхСвойств.Свойство(Свойство)
		 ИЛИ СтруктураИсключаемыхСвойств.Свойство(Свойство) Тогда
		
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Источник) = Тип("ПользовательИнформационнойБазы") Тогда
			
			Если Свойство = "Пароль"
			 ИЛИ Свойство = "СтарыйПароль" Тогда
				
				ЗначениеСвойства = Неопределено;
				
			ИначеЕсли Свойство = "ОсновнойИнтерфейс" Тогда
				ЗначениеСвойства = ?(Источник.ОсновнойИнтерфейс = Неопределено,
				                     "",
				                     Источник.ОсновнойИнтерфейс.Имя);
			
			ИначеЕсли Свойство = "РежимЗапуска" Тогда
				ПолноеИмяЗначения = ПолучитьПолноеИмяПредопределенногоЗначения(Источник.РежимЗапуска);
				ЗначениеСвойства = Сред(ПолноеИмяЗначения, Найти(ПолноеИмяЗначения, ".") + 1);
				
			ИначеЕсли Свойство = "Язык" Тогда
				ЗначениеСвойства = ?(Источник.Язык = Неопределено,
				                     "",
				                     Источник.Язык.Имя);
				
			ИначеЕсли Свойство = "Роли" Тогда
				
				ВременнаяСтруктура = Новый Структура("Роли", Новый ТаблицаЗначений);
				ЗаполнитьЗначенияСвойств(ВременнаяСтруктура, Приемник);
				Если ТипЗнч(ВременнаяСтруктура.Роли) = Тип("ТаблицаЗначений") Тогда
					Продолжить;
				ИначеЕсли ВременнаяСтруктура.Роли = Неопределено Тогда
					Приемник.Роли = Новый Массив;
				Иначе
					Приемник.Роли.Очистить();
				КонецЕсли;
				
				Для каждого Роль Из Источник.Роли Цикл
					Приемник.Роли.Добавить(Роль.Имя);
				КонецЦикла;
				
				Продолжить;
			Иначе
				ЗначениеСвойства = Источник[Свойство];
			КонецЕсли;
			
			ПолноеИмяСвойства = ПрефиксСвойств + Свойство;
			ВременнаяСтруктура = Новый Структура(ПолноеИмяСвойства, ЗначениеСвойства);
			ЗаполнитьЗначенияСвойств(Приемник, ВременнаяСтруктура);
		Иначе
			Если ТипЗнч(Источник) = Тип("Структура") Тогда
				Если Источник.Свойство(Свойство) Тогда
					ЗначениеСвойства = Источник[Свойство];
				Иначе
					Продолжить;
				КонецЕсли;
			Иначе
				ПолноеИмяСвойства = ПрефиксСвойств + Свойство;
				ВременнаяСтруктура = Новый Структура(ПолноеИмяСвойства, Новый ТаблицаЗначений);
				ЗаполнитьЗначенияСвойств(ВременнаяСтруктура, Источник);
				ЗначениеСвойства = ВременнаяСтруктура[ПолноеИмяСвойства];
				Если ТипЗнч(ЗначениеСвойства) = Тип("ТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ТипЗнч(Приемник) = Тип("ПользовательИнформационнойБазы") Тогда
			
				Если Свойство = "УникальныйИдентификатор"
				 ИЛИ Свойство = "СтарыйПароль"
				 ИЛИ Свойство = "ПарольУстановлен" Тогда
					
					Продолжить;
					
				ИначеЕсли Свойство = "АутентификацияOpenID"
				      ИЛИ Свойство = "АутентификацияСтандартная"
				      ИЛИ Свойство = "АутентификацияОС"
				      ИЛИ Свойство = "ПользовательОС" Тогда
					
					Если Приемник[Свойство] <> ЗначениеСвойства Тогда
						Приемник[Свойство] = ЗначениеСвойства;
					КонецЕсли;
					
				ИначеЕсли Свойство = "Пароль" Тогда
					Если ЗначениеСвойства <> Неопределено Тогда
						Приемник.Пароль = ЗначениеСвойства;
						ПарольУстановлен = Истина;
					КонецЕсли;
					
				ИначеЕсли Свойство = "СохраняемоеЗначениеПароля" Тогда
					Если ЗначениеСвойства <> Неопределено
					   И НЕ ПарольУстановлен Тогда
						Приемник.СохраняемоеЗначениеПароля = ЗначениеСвойства;
					КонецЕсли;
					
				ИначеЕсли Свойство = "ОсновнойИнтерфейс" Тогда
					Если ТипЗнч(ЗначениеСвойства) = Тип("Строка") Тогда
						Приемник.ОсновнойИнтерфейс = Метаданные.Интерфейсы.Найти(ЗначениеСвойства);
					Иначе
						Приемник.ОсновнойИнтерфейс = Неопределено;
					КонецЕсли;
				
				ИначеЕсли Свойство = "РежимЗапуска" Тогда
					Если ЗначениеСвойства = "Авто"
					 ИЛИ ЗначениеСвойства = "ОбычноеПриложение"
					 ИЛИ ЗначениеСвойства = "УправляемоеПриложение" Тогда
						
						Приемник.РежимЗапуска = РежимЗапускаКлиентскогоПриложения[ЗначениеСвойства];
					Иначе
						Приемник.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.Авто;
					КонецЕсли;
					
				ИначеЕсли Свойство = "Язык" Тогда
					Если ТипЗнч(ЗначениеСвойства) = Тип("Строка") Тогда
						Приемник.Язык = Метаданные.Языки.Найти(ЗначениеСвойства);
					Иначе
						Приемник.Язык = Неопределено;
					КонецЕсли;
					
				ИначеЕсли Свойство = "Роли" Тогда
					Приемник.Роли.Очистить();
					Если ЗначениеСвойства <> Неопределено Тогда
						Для каждого ИмяРоли Из ЗначениеСвойства Цикл
							Роль = Метаданные.Роли.Найти(ИмяРоли);
							Если Роль <> Неопределено Тогда
								Приемник.Роли.Добавить(Роль);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				Иначе
					Если Свойство = "Имя"
					   И Приемник[Свойство] <> ЗначениеСвойства Тогда
					
						Если СтрДлина(ЗначениеСвойства) > 64 Тогда
							ВызватьИсключение ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Ошибка записи пользователя информационной базы
								           |Имя (для входа): ""%1""
								           |превышает длину 64 символа.'"),
								ЗначениеСвойства);
							
						ИначеЕсли Найти(ЗначениеСвойства, ":") > 0 Тогда
							ВызватьИсключение ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Ошибка записи пользователя информационной базы
								           |Имя (для входа): ""%1""
								           |содержит запрещенный символ "":"".'"),
								ЗначениеСвойства);
						КонецЕсли;
					КонецЕсли;
					Приемник[Свойство] = Источник[Свойство];
				КонецЕсли;
			Иначе
				Если Свойство = "Роли" Тогда
					
					ВременнаяСтруктура = Новый Структура("Роли", Новый ТаблицаЗначений);
					ЗаполнитьЗначенияСвойств(ВременнаяСтруктура, Приемник);
					Если ТипЗнч(ВременнаяСтруктура.Роли) = Тип("ТаблицаЗначений") Тогда
						Продолжить;
					ИначеЕсли ВременнаяСтруктура.Роли = Неопределено Тогда
						Приемник.Роли = Новый Массив;
					Иначе
						Приемник.Роли.Очистить();
					КонецЕсли;
					
					Если Источник.Роли <> Неопределено Тогда
						Для каждого Роль Из Источник.Роли Цикл
							Приемник.Роли.Добавить(Роль.Имя);
						КонецЦикла;
					КонецЕсли;
					Продолжить;
					
				ИначеЕсли ТипЗнч(Источник) = Тип("Структура") Тогда
					ПолноеИмяСвойства = ПрефиксСвойств + Свойство;
				Иначе
					ПолноеИмяСвойства = Свойство;
				КонецЕсли;
				ВременнаяСтруктура = Новый Структура(ПолноеИмяСвойства, ЗначениеСвойства);
				ЗаполнитьЗначенияСвойств(Приемник, ВременнаяСтруктура);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоПолноправныйПользователь(Пользователь = Неопределено,
                                    ПроверятьПраваАдминистрированияСистемы = Ложь,
                                    УчитыватьПривилегированныйРежим = Истина) Экспорт
	
	ПривилегированныйРежимУстановлен = ПривилегированныйРежим();
	
	УстановитьПривилегированныйРежим(Истина);
	Свойства = СвойстваПроверяемогоПользователяИБ(Пользователь);
	ПользовательИБ = Свойства.ПользовательИБ;
	
	ПроверитьРольПолныеПрава = Не ПроверятьПраваАдминистрированияСистемы;
	ПроверитьРольАдминистратораСистемы = ПроверятьПраваАдминистрированияСистемы;
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли НЕ Свойства.УказанТекущийПользовательИБ Тогда
		// Для не текущего пользователя ИБ проверяются роли в записанном пользователе ИБ.
		Если ПроверитьРольПолныеПрава
		   И НЕ ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
			Возврат Ложь;
		КонецЕсли;
		Если ПроверитьРольАдминистратораСистемы
		   И НЕ ПользовательИБ.Роли.Содержит(РольАдминистратораСистемы(Истина)) Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
	Иначе
		Если УчитыватьПривилегированныйРежим И ПривилегированныйРежимУстановлен Тогда
			Возврат Истина;
		КонецЕсли;
		
		//Если СтандартныеПодсистемыПовтИсп.ПривилегированныйРежимУстановленПриЗапуске() Тогда
		//	// Когда клиентское приложение запущено с параметром UsePrivilegedMode, тогда
		//	// пользователь является полноправным, если привилегированный режим установлен.
		//	Возврат Истина;
		//КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПользовательИБ.Имя) И Метаданные.ОсновныеРоли.Количество() = 0 Тогда
			// Когда основные роли не указаны, тогда у неуказанного пользователя
			// есть все права (как в привилегированном режиме).
			Возврат Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПользовательИБ.Имя)
		   И ПривилегированныйРежимУстановлен
		   И ПравоДоступа("Администрирование", Метаданные, ПользовательИБ) Тогда
			// Когда у неуказанного пользователя есть право Администрирование,
			// тогда привилегированный режим учитывается всегда для поддержки
			// параметра запуска UsePrivilegedMode у не клиентских приложений.
			Возврат Истина;
		КонецЕсли;
		
		// Для текущего пользователя ИБ проверяются роли не в записанном пользователе ИБ,
		// а роли в текущем сеансе.
		Если ПроверитьРольПолныеПрава
		   И НЕ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда // Не заменять на РолиДоступны.
			Возврат Ложь;
		КонецЕсли;
		Если ПроверитьРольАдминистратораСистемы
		   И НЕ РольДоступна(РольАдминистратораСистемы(Истина)) Тогда // Не заменять на РолиДоступны.
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция РольАдминистратораСистемы(ДляПроверки = Ложь) Экспорт
	
	РольАдминистратораСистемы = Метаданные.Роли.АдминистраторСистемы;
	
	Если ДляПроверки
	   И ПравоДоступа("Администрирование", Метаданные, Метаданные.Роли.ПолныеПрава) Тогда
	
		РольАдминистратораСистемы = Метаданные.Роли.ПолныеПрава;
	КонецЕсли;
	
	Возврат РольАдминистратораСистемы;
	
КонецФункции

Функция СвойстваПроверяемогоПользователяИБ(Пользователь)
	
	Свойства = Новый Структура;
	Свойства.Вставить("ТекущийПользовательИБ", ПользователиИнформационнойБазы.ТекущийПользователь());
	Свойства.Вставить("ПользовательИБ", Неопределено);
	
	Если ТипЗнч(Пользователь) = Тип("ПользовательИнформационнойБазы") Тогда
		Свойства.Вставить("ПользовательИБ", Пользователь);
		
	ИначеЕсли Пользователь = Неопределено ИЛИ Пользователь = ПараметрыСеанса.АвторизованныйПользователь Тогда
		Свойства.Вставить("ПользовательИБ", Свойства.ТекущийПользовательИБ);
	Иначе
		// Задан не текущий пользователь.
		Если ЗначениеЗаполнено(Пользователь) Тогда
			Свойства.Вставить("ПользовательИБ", ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ")));
		КонецЕсли;
	КонецЕсли;
	
	Если Свойства.ПользовательИБ <> Неопределено Тогда
		Свойства.Вставить("УказанТекущийПользовательИБ",
			Свойства.ПользовательИБ.УникальныйИдентификатор
				= Свойства.ТекущийПользовательИБ.УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Свойства;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если НЕ Форма.Свойства_ИспользоватьСвойства
	 ИЛИ НЕ Форма.Свойства_ИспользоватьДопРеквизиты Тогда
		
		Возврат;
	КонецЕсли;
	
	Ошибки = Неопределено;
	
	Для каждого Строка Из Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
		Если Строка.ЗаполнятьОбязательно И НЕ Строка.Удалено Тогда
			Если НЕ ЗначениеЗаполнено(Форма[Строка.ИмяРеквизитаЗначение]) Тогда
				
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
					Строка.ИмяРеквизитаЗначение,
					ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Поле ""%1"" не заполнено.'"), Строка.Наименование),
					"");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

Функция ЗаписатьПользователяИБ(Знач Идентификатор,
                               Знач ОбновляемыеСвойства,
                               Знач СоздатьНового = Ложь,
                               ОписаниеОшибки = "",
                               ПользовательИБ = Неопределено) Экспорт
	
	ПользовательИБ = Неопределено;
	СтарыеСвойства = Неопределено;
	
	ПредварительноеЧтение = ПрочитатьПользователяИБ(
		Идентификатор, СтарыеСвойства, ОписаниеОшибки, ПользовательИБ);
	
	Если НЕ ПредварительноеЧтение Тогда
		
		Если СоздатьНового = Неопределено ИЛИ СоздатьНового = Истина Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли СоздатьНового = Истина Тогда
		ОписаниеОшибки = ОписаниеОшибкиПриЗаписиПользователяИБ(
			НСтр("ru = 'Невозможно создать пользователя информационной базы
			           |%1,
			           |так как он уже существует.'"),
			СтарыеСвойства.Имя,
			СтарыеСвойства.УникальныйИдентификатор);
		Возврат Ложь;
	Иначе
		Если ОбновляемыеСвойства.Свойство("СтарыйПароль")
		   И ТипЗнч(ОбновляемыеСвойства.СтарыйПароль) = Тип("Строка") Тогда
			
			СтарыйПарольСовпадает = Ложь;
			
			ОхотаСлужебный.СохраняемоеЗначениеСтрокиПароля(
				ОбновляемыеСвойства.СтарыйПароль,
				СтарыеСвойства.УникальныйИдентификатор,
				СтарыйПарольСовпадает);
			
			Если НЕ СтарыйПарольСовпадает Тогда
				ОписаниеОшибки = ОписаниеОшибкиПриЗаписиПользователяИБ(
					НСтр("ru = 'При записи пользователя информационной базы
					           |%1,
					           |старый пароль указан не верно.'"),
					СтарыеСвойства.Имя,
					СтарыеСвойства.УникальныйИдентификатор);
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Подготовка новых значений свойств.
	НовыеСвойства = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтарыеСвойства);
	
	Для каждого КлючИЗначение Из НовыеСвойства Цикл
		
		Если ОбновляемыеСвойства.Свойство(КлючИЗначение.Ключ)
		   И ОбновляемыеСвойства[КлючИЗначение.Ключ] <> Неопределено Тогда
		
			НовыеСвойства[КлючИЗначение.Ключ] = ОбновляемыеСвойства[КлючИЗначение.Ключ];
		КонецЕсли;
	КонецЦикла;
	
	СкопироватьСвойстваПользователяИБ(ПользовательИБ, НовыеСвойства);
	
	Если ОхотаСерверПовтИсп.РазделениеВключено() Тогда
		ПользовательИБ.ПоказыватьВСпискеВыбора = Ложь;
	КонецЕсли;
	
	// Попытка записи нового или измененного пользователяИБ.
	Попытка
		ОхотаСлужебный.ЗаписатьПользователяИнформационнойБазы(ПользовательИБ);
	Исключение
		ОписаниеОшибки = ОписаниеОшибкиПриЗаписиПользователяИБ(
			НСтр("ru = 'При записи пользователя информационной базы
			           |%1 произошла ошибка:
			           |
			           |""%2"".'"),
			ПользовательИБ.Имя,
			?(ПредварительноеЧтение, СтарыеСвойства.УникальныйИдентификатор, Неопределено),
			ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(СтарыеСвойства.Имя)
	   И СтарыеСвойства.Имя <> НовыеСвойства.Имя Тогда
		// Перемещение настроек.
		ОхотаСлужебный.СкопироватьНастройкиПользователя(
			СтарыеСвойства.Имя, НовыеСвойства.Имя, Истина);
	КонецЕсли;
	
	ОхотаСлужебный.ПриЗаписиПользователяИнформационнойБазы(СтарыеСвойства, НовыеСвойства);
	
	Если СоздатьНового = Неопределено ИЛИ СоздатьНового = Истина Тогда
		ОхотаСлужебный.УстановитьНачальныеНастройки(НовыеСвойства.Имя);
	КонецЕсли;
	
	ОбновляемыеСвойства.Вставить("УникальныйИдентификатор", ПользовательИБ.УникальныйИдентификатор);
	Возврат Истина;
	
КонецФункции

Функция УдалитьПользователяИБ(Знач Идентификатор,
                              ОписаниеОшибки = "",
                              ПользовательИБ = Неопределено) Экспорт
	
	ПользовательИБ = Неопределено;
	Свойства       = Неопределено;
	
	Если НЕ ПрочитатьПользователяИБ(Идентификатор, Свойства, ОписаниеОшибки, ПользовательИБ) Тогда
		Возврат Ложь;
	Иначе
		Попытка
			
			//Обработчики = ОбщегоНазначения.ОбработчикиСлужебногоСобытия("СтандартныеПодсистемы.Пользователи\ПередЗаписьюПользователяИБ");
			//Для Каждого Обработчик Из Обработчики Цикл
			//	Обработчик.Модуль.ПередЗаписьюПользователяИБ(ПользовательИБ.УникальныйИдентификатор);
			//КонецЦикла;
			
			ПользовательИБ.Удалить();
			
		Исключение
			ОписаниеОшибки = ОписаниеОшибкиПриЗаписиПользователяИБ(
				НСтр("ru = 'При удалении пользователя информационной базы
				           |%1 произошла ошибка:
				           |
				           |""%2"".'"),
				ПользовательИБ.Имя,
				ПользовательИБ.УникальныйИдентификатор,
				ИнформацияОбОшибке());
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	ОхотаСлужебный.ПослеУдаленияПользователяИнформационнойБазы(Свойства);
	
	Возврат Истина;
	
КонецФункции

Функция ОписаниеОшибкиПриЗаписиПользователяИБ(ШаблонОшибки,
                                              ИмяДляВхода,
                                              ИдентификаторПользователяИБ,
                                              ИнформацияОбОшибке = Неопределено,
                                              ЗаписатьВЖурнал = Истина)
	
	Если ЗаписатьВЖурнал Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Пользователи.Ошибка записи пользователя ИБ'",
			     ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонОшибки,
				"""" + ИмяДляВхода + """ ("
				+ ?(ЗначениеЗаполнено(ИдентификаторПользователяИБ),
					НСтр("ru = 'Новый'"),
					Строка(ИдентификаторПользователяИБ))
				+ ")",
				?(ИнформацияОбОшибке = Неопределено,
				  "",
				  ПодробноеПредставлениеОшибки(ИнформацияОбОшибке))));
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонОшибки,
		"""" + ИмяДляВхода + """",
		?(ИнформацияОбОшибке = Неопределено,
		  "",
		  КраткоеПредставлениеОшибки(ИнформацияОбОшибке)));
	
КонецФункции

Процедура ЗаполнитьЗаголовокОтчета(Отчет) Экспорт
	ПериодОтчета = Новый СтандартныйПериод;
	
	Если Отчет.Метаданные().Реквизиты.Найти("ПериодОтчета") <> Неопределено Тогда
		ПериодОтчета = Отчет.ПериодОтчета;
	КонецЕсли;
	
	КомпоновщикНастроек = Отчет.КомпоновщикНастроек;
	Заголовок = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Title");
	Охотхозяйство = Отчет.ОсновнаяОрганизация;
	
	НачалоЗаголовка = Отчет.Метаданные().Синоним;
	
	Если ЗначениеЗаполнено(ПериодОтчета) Тогда
		Заголовок.Значение = НачалоЗаголовка + " за период с " + Формат(ПериодОтчета.ДатаНачала,"ДЛФ=DD") + " по " + Формат(ПериодОтчета.ДатаОкончания,"ДЛФ=DD")	
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета").Использование =Ложь;
		СезонОхоты = Константы.ТекущийСезон.Получить();
		Если СезонОхоты.Пустая() Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	МИНИМУМ(СезоныОхоты.ДатаНачала) КАК ДатаНачала,
			|	МАКСИМУМ(СезоныОхоты.ДатаОкончания) КАК ДатаОкончания
			|ИЗ
			|	Справочник.СезоныОхоты КАК СезоныОхоты
			|ИМЕЮЩИЕ
			|	НЕ МАКСИМУМ(СезоныОхоты.Период) ЕСТЬ NULL ");
			
			Результат = Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				Заголовок = НачалоЗаголовка + " на " + Формат(ТекущаяДата(),"ДЛФ=DD");		
			Иначе
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				Заголовок.Значение = НачалоЗаголовка + " за период с " + Формат(Выборка.ДатаНачала,"ДЛФ=DD") + " по " + Формат(Выборка.ДатаОкончания,"ДЛФ=DD")	
			КонецЕсли;
		Иначе	
			
			ТекстЗапросаСКД = Отчет.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
			
			ПозРегистра = Найти(ТекстЗапросаСКД,"РегистрНакопления.");
			
			СтрокаСинонимаРегистра = Сред(ТекстЗапросаСКД,ПозРегистра + СтрДлина("РегистрНакопления."));
			
			ПозОбороты = Найти(СтрокаСинонимаРегистра,".Обороты(");
			
			Если ПозОбороты = 0 Тогда
				ПозПроб = Найти(СтрокаСинонимаРегистра," ");
				ИмяРегистра = Лев(СтрокаСинонимаРегистра,ПозПроб - 1);
			Иначе
			    ИмяРегистра = Лев(СтрокаСинонимаРегистра,ПозОбороты - 1);
			КонецЕсли;	 
			
			
			
			ИзмеренияРегистра = Метаданные.РегистрыНакопления[ИмяРегистра].Измерения;
			
			СтрокаОтбора = ?(ИзмеренияРегистра.Найти("СезонОхоты") = Неопределено,"","
			|СезонОхоты = &СезонОхоты");
			
			СтрокаОтбора = СтрокаОтбора + ?(ИзмеренияРегистра.Найти("СезонОхоты") = Неопределено,"", ?(НЕ ПустаяСтрока(СтрокаОтбора), " И ","") + "
			|	ВЫБОР
			|		КОГДА &Охотхозяйство = ЗНАЧЕНИЕ(Справочник.Охотхозяйства.ПустаяСсылка)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ Охотхозяйство = &Охотхозяйство
			|	КОНЕЦ");
			
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	МАКСИМУМ(ОборотыДокумента.Период) КАК КонецПериода,
			|	МИНИМУМ(ОборотыДокумента.Период) КАК НачалоПериода
			|ИЗ
			|	РегистрНакопления." + ИмяРегистра + ".Обороты(
			|			,
			|			,
			|			День," + СтрокаОтбора+ ") КАК ОборотыДокумента
			|
			|ИМЕЮЩИЕ
			|	НЕ МАКСИМУМ(ОборотыДокумента.Период) ЕСТЬ NULL ");
			
					
			Запрос.УстановитьПараметр("СезонОхоты",СезонОхоты);
			Запрос.УстановитьПараметр("Охотхозяйство",Охотхозяйство);
			
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				Заголовок.Значение = НачалоЗаголовка + " с " + Формат(Выборка.НачалоПериода,"ДЛФ=DD") + " по " + Формат(Выборка.КонецПериода,"ДЛФ=DD")		
			Иначе
				Заголовок.Значение = НачалоЗаголовка + " на " + Формат(ТекущаяДата(),"ДЛФ=DD");		
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
